Дошкольное_учреждение83/src/InformationRegisters/удуРегистрацияУчетныхДокументов/удуРегистрацияУчетныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуРегистрацияУчетныхДокументов</name>
  <resources>
    <name>ДокументДелопроизводства</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </resources>
  <dimensions>
    <name>УчетныйДокумент</name>
    <type>
      <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      <types>DocumentRef.удуПриемНаРаботуВОрганизацию</types>
      <types>DocumentRef.удуВозвратНаРаботуОрганизаций</types>
      <types>DocumentRef.удуПеремещениеТМЦ</types>
      <types>DocumentRef.удуОприходованиеТМЦ</types>
      <types>DocumentRef.удуЗаявкаНаЗачислениеРебенкаВДОУ</types>
      <types>DocumentRef.удуПриказОЗачисленииРебенкаВГруппу</types>
      <types>DocumentRef.удуСписаниеТМЦ</types>
      <types>DocumentRef.удуПриказОВыбытииИзГруппы</types>
      <types>DocumentRef.удуУвольнениеИзОрганизаций</types>
      <types>DocumentRef.удуПриказОПереводеВДругуюГруппу</types>
      <types>DocumentRef.удуКадровоеПеремещениеОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуНастройкиРегистрацииДокументов/удуНастройкиРегистрацииДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуНастройкиРегистрацииДокументов</name>
  <resources>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.ВидыВходящихДокументов</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
    </type>
  </resources>
  <resources>
    <name>ГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </resources>
  <resources>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>РегистрироватьДокумент</name>
    <comment>Зарегистрировать документ автоматически</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидУчетногоДокумента</name>
    <type>
      <types>EnumRef.удуВидыУчетныхДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуСвязьДокументовСДелопроизводством/удуСвязьДокументовСДелопроизводством.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуСвязьДокументовСДелопроизводством</name>
  <resources>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументДОУ</name>
    <type>
      <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      <types>CatalogRef.удуДокументыПропускаЗанятий</types>
      <types>DocumentRef.удуПриемНаРаботуВОрганизацию</types>
      <types>DocumentRef.удуВозвратНаРаботуОрганизаций</types>
      <types>DocumentRef.удуПеремещениеТМЦ</types>
      <types>DocumentRef.удуОприходованиеТМЦ</types>
      <types>DocumentRef.удуЗаявкаНаЗачислениеРебенкаВДОУ</types>
      <types>DocumentRef.удуПриказОЗачисленииРебенкаВГруппу</types>
      <types>DocumentRef.удуСписаниеТМЦ</types>
      <types>DocumentRef.удуПриказОВыбытииИзГруппы</types>
      <types>DocumentRef.удуУвольнениеИзОрганизаций</types>
      <types>DocumentRef.удуПриказОПереводеВДругуюГруппу</types>
      <types>DocumentRef.удуКадровоеПеремещениеОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументДелопроизводства</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Enums/удуВидыУчетныхДокументов/удуВидыУчетныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуВидыУчетныхДокументов</name>
  <enumValues>
    <name>ПриказОЗачисленииРебенкаВГруппу</name>
  </enumValues>
  <enumValues>
    <name>ПриказОПереводРебенка</name>
  </enumValues>
  <enumValues>
    <name>ПриказОВыбытииРебенкаИзДОУ</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаЗачисление</name>
  </enumValues>
  <enumValues>
    <name>ДоговорНаЗачислениеРебенка</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаРаботу</name>
  </enumValues>
  <enumValues>
    <name>КадровоеПеремещение</name>
  </enumValues>
  <enumValues>
    <name>УвольнениеСотрудника</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСотрудникаНаРаботу</name>
  </enumValues>
  <enumValues>
    <name>ОприходовываниеТМЦ</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТМЦ</name>
  </enumValues>
  <enumValues>
    <name>СписаниеТМЦ</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Enums/СпособыНумерации/СпособыНумерации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыНумерации</name>
  <enumValues>
    <name>Автоматически</name>
  </enumValues>
  <enumValues>
    <name>Вручную</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/Корреспонденты/Корреспонденты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Корреспонденты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидКорреспондента</name>
    <type>
      <types>EnumRef.ВидыКорреспондентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКорреспондентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>удуРодитель</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/ВнутренниеДокументы/ВнутренниеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнутренниеДокументы</name>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дело</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение подготовившего</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>удуДержательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>удуРебенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>удуДети</name>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/CommonModules/удуРегистрацияУчетныхДокументовСервер/Module.bsl
// Функция позволяет получить по экземпляру документа ассоциированное значение перечисления
// удуВидыУчетныхДокументов
//
// Параметры:
//  Ссылка       - ДокументСсылка - ссылка на учетный документ.
//
// Возвращаемое значение:
// Перечисление.удуВидыУчетныхДокументов
//				- если данный вид документа предназначен для автоматической регистрации
// Неопределено	- в противном случае
//                                  
Функция ПолучитьПеречислениеПоТипу(Ссылка) Экспорт
	
	Если Ссылка = Неопределено Тогда
		Возврат Неопределено;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.удуПриказОВыбытииИзГруппы") Тогда
		Возврат Перечисления.удуВидыУчетныхДокументов.ПриказОВыбытииРебенкаИзДОУ;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.удуПриказОЗачисленииРебенкаВГруппу") Тогда
		Возврат Перечисления.удуВидыУчетныхДокументов.ПриказОЗачисленииРебенкаВГруппу;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.удуПриказОПереводеВДругуюГруппу") Тогда
		Возврат Перечисления.удуВидыУчетныхДокументов.ПриказОПереводРебенка;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.удуЗаявкаНаЗачислениеРебенкаВДОУ") Тогда
		Возврат Перечисления.удуВидыУчетныхДокументов.ЗаявкаНаЗачисление;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.удуДоговорОЗачисленииРебенка") Тогда
		Возврат Перечисления.удуВидыУчетныхДокументов.ДоговорНаЗачислениеРебенка;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.удуОприходованиеТМЦ") Тогда
		Возврат Перечисления.удуВидыУчетныхДокументов.ОприходовываниеТМЦ;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.удуПеремещениеТМЦ") Тогда
		Возврат Перечисления.удуВидыУчетныхДокументов.ПеремещениеТМЦ;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.удуСписаниеТМЦ") Тогда
		Возврат Перечисления.удуВидыУчетныхДокументов.СписаниеТМЦ;
				
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.удуПриемНаРаботуВОрганизацию") Тогда
		Возврат Перечисления.удуВидыУчетныхДокументов.ПриемНаРаботу;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.удуКадровоеПеремещениеОрганизаций") Тогда
		Возврат Перечисления.удуВидыУчетныхДокументов.КадровоеПеремещение;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.удуУвольнениеИзОрганизаций") Тогда
		Возврат Перечисления.удуВидыУчетныхДокументов.УвольнениеСотрудника;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.удуВозвратНаРаботуОрганизаций") Тогда
		Возврат Перечисления.удуВидыУчетныхДокументов.ВозвратСотрудникаНаРаботу;
				
	Иначе Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Функция создает делопроизводственный документ для указанного учетного документа, если соответсвующая настройка
// сделана в регистре сведений удуНастройкиРегистрацииДокументов. Затем открывает карточку данного документа.
//
// Параметры:
//
// - Учетный документ	- учетный документ, для которого нужно зарегистрировать документ
//
// - Корреспондент		- корреспондент в отношении которого возник документ
//
// - СведенияОДетях		- массив детей, в отношении которых возник документ
//
// Возвращаемое значение:
// Структура
//
// - Документ,
// 		- СправочникСсылка.ВнутренниеДокументы ИЛИ
// 		- СправочникСсылка.ВходящиеДокументы ИЛИ
// 		- СправочникСсылка.ИсходящиеДокументы	- если документ был создан успешно
// ИЛИ
// 		- Неопределено в случае ошибки
//
// - Успешно, булево 	- Истина - успешно, Ложь - произошла ошибка
//
// - Сообщение, Строка	- Сообщение об ошибке
Функция РегистрироватьДокумент(УчетныйДокумент, Корреспондент = Неопределено, СведенияОДетях = Неопределено) Экспорт
	
	НачатьТранзакцию();
	
	Результат = Новый Структура("Успешно, Документ, Сообщение", Ложь, Неопределено, Нстр("ru = 'Документ успешно зарегистрирован.'"));
	
	// проверка наличия зарегистрированного документа
	Отбор = Новый Структура("УчетныйДокумент", УчетныйДокумент);
	Документ = РегистрыСведений.удуРегистрацияУчетныхДокументов.Получить(Отбор).ДокументДелопроизводства;
	Если Документ <> Неопределено Тогда
		Результат.Успешно = Ложь;
		Результат.Документ = Документ;                               
		Результат.Сообщение = НСтр("ru = 'Документ уже зарегистрирован в системе!'");
		Возврат Результат;
	КонецЕсли;
	
	// получаем настройки
	Отбор = Новый Структура("ВидУчетногоДокумента", ПолучитьПеречислениеПоТипу(УчетныйДокумент));
	Настройки = РегистрыСведений.удуНастройкиРегистрацииДокументов.Получить(Отбор);
	Если Настройки.ВидДокумента = Неопределено Тогда
		Результат.Успешно = Ложь;
		Результат.Сообщение = НСтр("ru = 'Для данного вида учетного документа не заданы настройки автоматической регистрации!'");
		Возврат Результат;
	КонецЕсли;
	
	// Запись документа.
	
	Если Корреспондент = Неопределено Тогда
		Корреспондент = ПолучитьКорреспондента(УчетныйДокумент.Ссылка);
	КонецЕсли;
	
	Корреспондент = ?(Корреспондент = Неопределено, Справочники.Корреспонденты.ПустаяСсылка(), Корреспондент);
	
	Если ТипЗнч(Настройки.ВидДокумента) = Тип("СправочникСсылка.ВидыВнутреннихДокументов") Тогда
		
		Документ = Справочники.ВнутренниеДокументы.СоздатьЭлемент();
		Документ.Папка = Настройки.Папка;
		
		Если Настройки.ВидДокумента.УчетПоКорреспондентам Тогда
			Документ.Корреспондент = Корреспондент;
		КонецЕсли;
		
		Документ.Подготовил = ОбщегоНазначения.ТекущийПользователь();
		
		Если СведенияОДетях = Неопределено Тогда
			СведенияОДетях = ПолучитьСведенияОДетях(УчетныйДокумент);
		КонецЕсли;
		
		Если СведенияОДетях <> Неопределено Тогда
			Для Каждого Ребенок Из СведенияОДетях Цикл
				Строка = Документ.удуДети.Добавить();
				Строка.Ребенок = Ребенок;
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		
		Если ТипЗнч(Настройки.ВидДокумента) = Тип("СправочникСсылка.ВидыВходящихДокументов") Тогда
			Документ = Справочники.ВходящиеДокументы.СоздатьЭлемент();
			Документ.Отправитель = Корреспондент;
			
		Иначе	//исходящий документ
			
			Документ = Справочники.ИсходящиеДокументы.СоздатьЭлемент();
			Документ.Адресат = Корреспондент;
			Документ.Подготовил = ОбщегоНазначения.ТекущийПользователь();
			
		КонецЕсли;
		
		Если Константы.ИспользоватьГрифыДоступаКВходящимИИсходящимДокументам.Получить() Тогда
			Документ.ГрифДоступа = Настройки.ГрифДоступа;
		КонецЕсли;
		
	КонецЕсли;
	
	// Заполнение общих реквизитов.
	Документ.ВидДокумента = Настройки.ВидДокумента;
	
	Документ.Заголовок = УчетныйДокумент.Метаданные().Синоним;
	
	Если Константы.ИспользоватьУчетПоОрганизациям.Получить() Тогда
		Документ.Организация = Настройки.Организация;
	КонецЕсли;
	
	Если Документ.ВидДокумента.СпособНумерации = Перечисления.СпособыНумерации.Вручную Тогда
		Документ.РегистрационныйНомер = УчетныйДокумент.Код;
	КонецЕсли;	
			
	Документ.Записать();
	
		// Запись документа.
	
	// Записать соответствие между документами.
	МЗ = РегистрыСведений.удуРегистрацияУчетныхДокументов.СоздатьМенеджерЗаписи();
	МЗ.УчетныйДокумент = УчетныйДокумент;
	МЗ.ДокументДелопроизводства = Документ.Ссылка;
	МЗ.Записать(Ложь);
	
	// Записать информацию в связь между документами.
	МЗ = РегистрыСведений.удуСвязьДокументовСДелопроизводством.СоздатьМенеджерЗаписи();
	МЗ.ДокументДОУ = УчетныйДокумент;
	МЗ.ДокументДелопроизводства = Документ.Ссылка;
	МЗ.ВидДокумента = Документ.Метаданные().Синоним;
	МЗ.Комментарий = "Регистрация документа";
	МЗ.Записать(Ложь);             	
	
	ЗафиксироватьТранзакцию();
	
	Результат.Документ = Документ.Ссылка;
	Результат.Успешно = Истина;
	
	Возврат Результат;	
	
КонецФункции

// Функция извлекает перечень детей из учетного документа.
//
// Параметры:
//
// - Ссылка	- ссылка на учетный документ
//
// Возвращаемое значение:
// - Массив детей (СправочникСсылка.удуДети)
// - Неопределено, если документ не содержит сведений о детях
Функция ПолучитьСведенияОДетях(Ссылка)
	
	Если Ссылка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Сведения = Неопределено;
	ТипДокумента = ТипЗнч(Ссылка);
		
	Если ТипДокумента = Тип("ДокументСсылка.удуПриказОВыбытииИзГруппы")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.удуПриказОПереводеВДругуюГруппу") Тогда
		Сведения = Ссылка.ТабличнаяЧастьВоспитанники.ВыгрузитьКолонку("Ребенок");
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.удуПриказОЗачисленииРебенкаВГруппу") Тогда
		Сведения = Ссылка.ТабличнаяЧастьЗачисление.ВыгрузитьКолонку("Ребенок");
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.удуЗаявкаНаЗачислениеРебенкаВДОУ")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.удуДоговорОЗачисленииРебенка") Тогда
		Сведения = Новый Массив();
		Сведения.Добавить(Ссылка.Ребенок);
	КонецЕсли;
	
	Возврат Сведения;
	
КонецФункции

// Функция извлекает возможных корреспондентов из учетного документа.
//
// Параметры:
//
// - Ссылка	- ссылка на учетный документ
//
// Возвращаемое значение:
// - Корреспондентов (СправочникСсылка.Корреспонденты)
// - Неопределено, если документ не содержит ссылки на Корреспондента
Функция ПолучитьКорреспондента(Ссылка)
	
	Родитель = Неопределено;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.удуЗаявкаНаЗачислениеРебенкаВДОУ") Тогда
		Родитель = Ссылка.РодительПодавшийЗаявку;		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.удуДоговорОЗачисленииРебенка") Тогда
		Родитель = Ссылка.Родитель;
	КонецЕсли;
	
	Если Не Родитель = Неопределено Тогда
		Корреспондент = Справочники.Корреспонденты.НайтиПоРеквизиту("удуРодитель", Родитель);
		Если Не Корреспондент.Пустая() Тогда
			Родитель = Корреспондент;
		КонецЕсли;
	КонецЕсли;
		
	Возврат Родитель;
	
КонецФункции

&НаСервере
Процедура ЗаписатьСвязь(УчетныйДокумент, Документ, ТипДокумента, Комментарий) Экспорт
	
	// Записать информацию в связь между документами.
	МЗ = РегистрыСведений.удуСвязьДокументовСДелопроизводством.СоздатьМенеджерЗаписи();
	МЗ.ДокументДОУ = УчетныйДокумент;
	МЗ.ДокументДелопроизводства = Документ;
	МЗ.ВидДокумента = ТипДокумента;
	МЗ.Комментарий = Комментарий;
	МЗ.Записать(Ложь);
	
КонецПроцедуры
